In [2]:
import pandas as pd

In [3]:
people= {
    "first" :["Ania", "Marysia", "Ola"],       
    "last" :["Osten", "Marck", "Sir"],
    "email": ["@gmail", "@pl", "@.com"]}

In [3]:
people

{'first': ['Ania', 'Marysia', 'Ola'],
 'last': ['Osten', 'Marck', 'Sir'],
 'email': ['@gmail', '@pl', '@.com']}

In [4]:
nazwa = pd.DataFrame(people)

In [5]:
nazwa

     first   last   email
0     Ania  Osten  @gmail
1  Marysia  Marck     @pl
2      Ola    Sir   @.com

In [6]:
nazwa['last'] =='Osten'

0     True
1    False
2    False
Name: last, dtype: bool

In [7]:
filt = (nazwa['last'] == 'Osten')

In [8]:
nazwa[filt]

  first   last   email
0  Ania  Osten  @gmail

In [9]:
filt =(nazwa['first'] =='Ania')

In [10]:
nazwa.loc[filt, 'email']

0    @gmail
Name: email, dtype: object

In [12]:
filt = (nazwa['first'] == 'Ania') & (nazwa['last'] =='Osten')

In [13]:
nazwa[filt]

  first   last   email
0  Ania  Osten  @gmail

In [14]:
filt =(nazwa['first'] =='Ania')

In [15]:
nazwa[~filt]

     first   last  email
1  Marysia  Marck    @pl
2      Ola    Sir  @.com

NameError: name 'na' is not defined

In [6]:
nazwa

     first   last   email
0     Ania  Osten  @gmail
1  Marysia  Marck     @pl
2      Ola    Sir   @.com

In [7]:
nazwa.apply(len)

first    3
last     3
email    3
dtype: int64

In [9]:
nazwa.drop(columns='first')

    last   email
0  Osten  @gmail
1  Marck     @pl
2    Sir   @.com

In [10]:
nazwa

     first   last   email
0     Ania  Osten  @gmail
1  Marysia  Marck     @pl
2      Ola    Sir   @.com

In [11]:
nazwa.drop(columns='first', inplace=True)

In [12]:
nazwa

    last   email
0  Osten  @gmail
1  Marck     @pl
2    Sir   @.com

In [13]:
nazwa['first']=['Ania','Marysia','Ola']

In [14]:
nazwa

    last   email    first
0  Osten  @gmail     Ania
1  Marck     @pl  Marysia
2    Sir   @.com      Ola

In [17]:
nazwa.append({'last':'Mazur', 'email':'maz@', 'first':'Kate'}, ignore_index=True)

    last   email    first
0  Osten  @gmail     Ania
1  Marck     @pl  Marysia
2    Sir   @.com      Ola
3  Mazur    maz@     Kate